src/cf/Catalogs/КлассификаторОКОПФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КлассификаторОКОПФ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйВыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КлассификаторОКОПФ/Forms/ФормаПодбораИзКлассификатора/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция НайтиСсылкуПоКоду(КодЧисловой)
	Возврат Справочники.КлассификаторОКОПФ.НайтиПоКоду(КодЧисловой);
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьНовыйЭлемент(СтруктураПараметров)
	СправочникОбъект=Справочники.КлассификаторОКОПФ.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СправочникОбъект, СтруктураПараметров);
	СправочникОбъект.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповешения_ОтветНаВопрос(Параметр1, Параметр2) Экспорт
	Если НЕ Параметр1=КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	СоздатьНовыйЭлемент(Параметр2);	
	ВладелецФормы.Элементы.ДинамическийСписок.Обновить();
КонецПроцедуры

&НаСервере
Процедура ТабличноеПоле_Инициализация()
	Макет=Справочники.КлассификаторОКОПФ.ПолучитьМакет("КлассификаторОКОПФ");
	Макет.Параметры.Расшифровка=Истина; // чтобы работала расшифровка

	ПолеТабличногоДокумента.Очистить();
	ПолеТабличногоДокумента.Вывести(Макет);

	ПолеТабличногоДокумента.ФиксацияСверху=3;	
	ПолеТабличногоДокумента.ОтображатьЗаголовки=Ложь;
	ПолеТабличногоДокумента.ОтображатьСетку=Ложь;
	ПолеТабличногоДокумента.ТолькоПросмотр=Истина;
КонецПроцедуры
 
&НаКлиенте
Процедура ТабличноеПоле_ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	ТекущаяОбласть=ПолеТабличногоДокумента.ТекущаяОбласть;		
	Если ТекущаяОбласть.Низ=ТекущаяОбласть.Верх Тогда
		КодЧисловой=ПолеТабличногоДокумента.Область(ТекущаяОбласть.Низ, 2).Текст;
		Если Не ЗначениеЗаполнено(КодЧисловой) Тогда Возврат; КонецЕсли; 

		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("Ключ", НайтиСсылкуПоКоду(КодЧисловой));

		Если СтруктураПараметров.Ключ.Пустая() Тогда
			СтруктураПараметров.Вставить("Код", КодЧисловой);
			СтруктураПараметров.Вставить("НаименованиеПолное", ПолеТабличногоДокумента.Область(ТекущаяОбласть.Низ, 3).Текст);
			СтруктураПараметров.Вставить("Наименование", ПолеТабличногоДокумента.Область(ТекущаяОбласть.Низ, 4).Текст);
			Если ПустаяСтрока(СтруктураПараметров.Наименование) Тогда
				СтруктураПараметров.Наименование=СтруктураПараметров.НаименованиеПолное;
			КонецЕсли;
			ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповешения_ОтветНаВопрос", ЭтотОбъект, СтруктураПараметров);
			стрВопрос="Записать в справочник ""Классификатор ОКОПФ"" элемент с наименование """+СтруктураПараметров.НаименованиеПолное+"""?";
			ПоказатьВопрос(ОписаниеОповещения, стрВопрос, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, "Внимание", КодВозвратаДиалога.Нет);
		Иначе
			ОткрытьФорму("Справочник.КлассификаторОКОПФ.Форма.ФормаЭлемента", СтруктураПараметров, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;				
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабличноеПоле_Инициализация();
КонецПроцедуры
